In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\james\appdata\local\programs\python\python38\lib\site-packages (1.1.0)
Requirement already satisfied: numpy>=1.15.4 in c:\users\james\appdata\local\programs\python\python38\lib\site-packages (from pandas) (1.19.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\james\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\james\appdata\local\programs\python\python38\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\users\james\appdata\local\programs\python\python38\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

WARNING: You are using pip version 19.2.3, however version 20.2.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [2]:
import pandas as pd

In [3]:
dic={'name':['james', 'tina','eric', 'mike', 'donald'], 
     'phone':['0910817850','0916173296','0999111222', '09888888888','0999111222'], 
     'email':['james@alcorlink.com', 'tina@tclink.com','erichsu@alcorlink.com', 'mike@alcorlink.com', 'donald@alcorlink.com']}
dic

{'name': ['james', 'tina', 'eric', 'mike', 'donald'],
 'phone': ['0910817850',
  '0916173296',
  '0999111222',
  '09888888888',
  '0999111222'],
 'email': ['james@alcorlink.com',
  'tina@tclink.com',
  'erichsu@alcorlink.com',
  'mike@alcorlink.com',
  'donald@alcorlink.com']}

In [4]:
df = pd.DataFrame(dic)

In [5]:
df

     name        phone                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2    eric   0999111222  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [6]:
df.shape    # (rows, col)

(5, 3)

In [7]:
df.info()   # shows columns / rows and types

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   phone   5 non-null      object
 2   email   5 non-null      object
dtypes: object(3)
memory usage: 248.0+ bytes

In [8]:
df.count()  # counts rows of columns

name     5
phone    5
email    5
dtype: int64

In [9]:
df.drop(1)  # drops rows / index

     name        phone                  email
0   james   0910817850    james@alcorlink.com
2    eric   0999111222  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [10]:
df.drop('phone', axis=1)  # drops columns

     name                  email
0   james    james@alcorlink.com
1    tina        tina@tclink.com
2    eric  erichsu@alcorlink.com
3    mike     mike@alcorlink.com
4  donald   donald@alcorlink.com

In [11]:
df.columns  # [_ for _ in df.index]

Index(['name', 'phone', 'email'], dtype='object')

In [12]:
# df.email        # bad if col name is same as attribute of df. Ex: 'count'
df['email']    # extract 1 column

0      james@alcorlink.com
1          tina@tclink.com
2    erichsu@alcorlink.com
3       mike@alcorlink.com
4     donald@alcorlink.com
Name: email, dtype: object

In [13]:
df[['name','phone']]   # extract multiple columns

     name        phone
0   james   0910817850
1    tina   0916173296
2    eric   0999111222
3    mike  09888888888
4  donald   0999111222

In [14]:
# <iloc> get rows by index 
df.iloc[0]      # extract 1st   row
df.iloc[[0,1]]  # get multi rows

# 2nd arg: columns
df.iloc[[0,1],1]  # 1,2 row's 1st col

0    0910817850
1    0916173296
Name: phone, dtype: object

In [15]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [16]:
df.loc[0]     # get 1st row    < loc combines with labels (later) >

name                   james
phone             0910817850
email    james@alcorlink.com
Name: 0, dtype: object

In [17]:
df.loc[[0,1]] # get mult rows

    name       phone                email
0  james  0910817850  james@alcorlink.com
1   tina  0916173296      tina@tclink.com

In [18]:
df.loc[[0,1],'phone']  # get multiple rows
df.loc[0:2, 'phone']   # when use ':', dont' use brackets

0    0910817850
1    0916173296
2    0999111222
Name: phone, dtype: object

In [19]:
df

     name        phone                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2    eric   0999111222  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [20]:
# set a column as index
df.set_index(df['name']) 
####################################
### NOTE ###  
# => df ususally doesn't do inplace,
# => inplace = True

          name        phone                  email
name
james    james   0910817850    james@alcorlink.com
tina      tina   0916173296        tina@tclink.com
eric      eric   0999111222  erichsu@alcorlink.com
mike      mike  09888888888     mike@alcorlink.com
donald  donald   0999111222   donald@alcorlink.com

In [21]:
filt = (df['phone'] == '0999111222')  # Filter mask, True...False
filt

0    False
1    False
2     True
3    False
4     True
Name: phone, dtype: bool

In [22]:
df[filt]

     name       phone                  email
2    eric  0999111222  erichsu@alcorlink.com
4  donald  0999111222   donald@alcorlink.com

In [23]:
df.loc[filt]
df.loc[filt, 'email']

2    erichsu@alcorlink.com
4     donald@alcorlink.com
Name: email, dtype: object

In [24]:
df

     name        phone                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2    eric   0999111222  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [25]:
#=============================
# write

In [26]:
df.rename(columns={'phone':'tele'}, inplace = True)

In [27]:
df

     name         tele                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2    eric   0999111222  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [28]:
df.loc[2,'tele']  = '0888888'

In [29]:
df.loc[2, ['name','tele']] = ['eric2', '077777']
#df[filt, 'tele'] = '0aaa' # xxxx use loc

In [30]:
df

     name         tele                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2   eric2       077777  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [31]:
df['name'] = df['name'].str.upper()
# df = df.drop('james', axis=1)
df['name'] = df['name'].str.lower()
df

     name         tele                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2   eric2       077777  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [32]:
# apply      # APPLY TO SERIES
# applymap   # APPLY TO DF ALL ELEMS
# map        # APPLY TO SERIES, USING DIC A->B
# replace

In [33]:
df['email'].apply(lambda s: s[:3])  # apply to columns....

0    jam
1    tin
2    eri
3    mik
4    don
Name: email, dtype: object

In [34]:
# james@alcorlink.com -> jmsa....(even chars)
[_ for idx, _ in enumerate("hello") if idx % 2 == 0]

df['email'].apply(lambda s: "".join([_ for idx, _ in enumerate(s) if idx % 2 == 0]))

0     jmsacrikcm
1       tn@cikcm
2    eihuacrikcm
3      mk@loln.o
4     dnl@loln.o
Name: email, dtype: object

In [35]:
df.apply(len)

name     5
tele     5
email    5
dtype: int64

In [43]:
df.apply(len, axis='columns') # axis = columns ==> How many columns?  (same as axis = 1)

0    3
1    3
2    3
3    3
4    3
dtype: int64

In [37]:
df

     name         tele                  email
0   james   0910817850    james@alcorlink.com
1    tina   0916173296        tina@tclink.com
2   eric2       077777  erichsu@alcorlink.com
3    mike  09888888888     mike@alcorlink.com
4  donald   0999111222   donald@alcorlink.com

In [40]:
# Use Map to replace items  (Notice NaN)
df['name'].map({'james':'James', 'tina':'Tina','mike':'Mike'})

0    James
1     Tina
2      NaN
3     Mike
4      NaN
Name: name, dtype: object

In [41]:
# Use Replace to replace items (Notice items not in dic)
df['name'].replace({'james':'James', 'tina':'Tina','mike':'Mike'})

0     James
1      Tina
2     eric2
3      Mike
4    donald
Name: name, dtype: object

In [45]:
# Change Column names  (inplace=True to write)
df.rename(columns={'name':'First Name'})  # ,inplace=True

  First Name         tele                  email
0      james   0910817850    james@alcorlink.com
1       tina   0916173296        tina@tclink.com
2      eric2       077777  erichsu@alcorlink.com
3       mike  09888888888     mike@alcorlink.com
4     donald   0999111222   donald@alcorlink.com